{
  "greeting": {
    "pattern": "^(hi|hello|hey|greetings)",
    "response": "Hi! I'm here to help you learn about Ramachandra Nalam, a Data Engineer at Meta. Ask me about his experience, skills, projects, or how to get in touch!"
  },
  "experience": {
    "keywords": ["experience", "work", "job", "career", "meta", "amazon", "nike", "buffalo"],
    "response": "Ramachandra has 7+ years of data engineering experience. Currently at Meta as a Data Engineer handling 50B+ daily events. Previously worked at Amazon (ETL optimization), University at Buffalo (ML for student success), and Nike India (large-scale data processing)."
  },
  "skills": {
    "keywords": ["skills", "technology", "tech", "tools", "programming", "languages", "python", "spark", "kafka"],
    "response": "Ramachandra's technical skills include Python, R, Scala, SQL, JavaScript, Apache Spark, Kafka, Airflow, AWS (Glue, S3, Redshift), Snowflake, dbt, Tableau, Power BI, and machine learning with TensorFlow."
  },
  "projects": {
    "keywords": ["projects", "project", "work", "built", "developed", "chatbot", "analytics", "pipeline"],
    "response": "Key projects include: Real-time Messaging Analytics at Meta (50B+ events/day), AWS Streaming & ETL at Amazon, Student Success Analytics using ML at University at Buffalo, Enterprise ETL Platform at Nike, and GenAI chatbot systems."
  },
  "education": {
    "keywords": ["education", "degree", "university", "college", "study", "buffalo", "data science"],
    "response": "Ramachandra holds a Master of Science in Data Science from University at Buffalo (2021-2022) and a Bachelor of Technology in Computer Science from K L University (2014-2018)."
  },
  "contact": {
    "keywords": ["contact", "email", "phone", "linkedin", "reach", "connect", "hire", "available"],
    "response": "You can reach Ramachandra at nrcvamsi@gmail.com, phone: +1 (508) 614-0301, or connect on LinkedIn: linkedin.com/in/ramachandra-nalam/. Located in Seattle, WA."
  },
  "location": {
    "keywords": ["location", "where", "based", "seattle", "live", "remote"],
    "response": "Ramachandra is currently based in Seattle, WA and works at Meta. He's experienced with both on-site and remote work environments."
  },
  "achievements": {
    "keywords": ["achievements", "success", "impact", "results", "metrics", "improvement"],
    "response": "Notable achievements: 60% reduction in data modeling complexity, 99.9% data accuracy, 40% cost reduction in Snowflake, 35% reduction in data lag, 52% CPU utilization improvement, and 23% increase in graduation rates through ML predictions."
  },
  "default": {
    "response": "I can help you learn about Ramachandra's experience at Meta, Amazon, and other companies, his technical skills in data engineering, his projects, education, or contact information. What would you like to know?"
  }
}
